= 前書き

こんにちは！心戸ろここといいます！
最近、ビジネスの世界では「デジタルトランスフォーメーション（DX）」という言葉をよく耳にします。
しかし、多くの会社ではこの言葉がただの流行り言葉になっていて、実際には大きな変化が見られません。
特に、Microsoftのアプリケーションを使って仕事を少し楽にしただけで、
本当に大切な「データを上手に使う」ことには至っていないようです。

この本を手に取ってくださったあなたには、ただデータを保存するだけではなく、
それをどう活用するかを学んでいただきたいです。

たとえば、Excelでリストを作るのではなく、SharePointリストを使ってデータをもっと賢く管理する方法です。

私たちの日常生活でよく使うツールでも、その真の力を知ればもっと多くのことができるようになります。
この本を通じて、そんな「知って得する」情報をお伝えし、
あなたの仕事や組織のデータ管理を一歩前進させる手助けができればと思います。

今回は、「SharePointリスト」について重点的にお話をしていきたいと思います。


DXがただのブームで終わらせないためにも、
この本でしっかりと学び、実践していきましょう。
データを活用する楽しさと、それがもたらす良い変化を、一緒に体験していきましょう！





== 免責事項

本書に記載された内容は、情報の提供のみを目的としています。したがって、本書を用いた開発、製作、運用は、必ずご自身の責任と判断によって行ってください。
これらの情報による開発、製作、運用の結果について、著者はいかなる責任も負いません。
